#### Data Input & Output
1. CSV
2. Excel
3. HTML
4. SQL

In [1]:
import numpy as np
import pandas as pd

In [2]:
pwd

'/Users/How.Short/Desktop'

In [3]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
df = pd.read_csv('example')

In [5]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
df.to_csv('My_output',index = False)

用 to_csv 的方法，可以將檔案輸出為 CSV，且 index = False ，代表在存檔時，不會將原本 index 這欄存入檔案中。

In [7]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

如果在一個 excel 裡面，有很多個 sheet，則可以用 sheet_name 來決定要輸出的 sheet。

In [8]:
df.to_excel('Excel_Sample2.xlsx',sheet_name = 'NewSheet')

在存檔時，也可以自己更改 sheet 的名稱。

In [9]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [10]:
data

[                                             Bank Name        City  ST   CERT  \
 0                                 The Enloe State Bank      Cooper  TX  10716
 1                  Washington Federal Bank for Savings     Chicago  IL  30570
 2      The Farmers and Merchants State Bank of Argonia     Argonia  KS  17719
 3                                  Fayette County Bank  Saint Elmo  IL   1802
 4    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...   Milwaukee  WI  30003
 ..                                                 ...         ...  ..    ...
 551                                 Superior Bank, FSB    Hinsdale  IL  32646
 552                                Malta National Bank       Malta  OH   6629
 553                    First Alliance Bank & Trust Co.  Manchester  NH  34264
 554                  National State Bank of Metropolis  Metropolis  IL   3815
 555                                   Bank of Honolulu    Honolulu  HI  21029

                    Acquiring Institution       Closing Date       Updated Date
 0                     Legend Bank, N. A.       May 31, 2019    August 22, 2019
 1                     Royal Savings Bank  December 15, 2017      July 24, 2019
 2                            Conway Bank   October 13, 2017    August 12, 2019
 3              United Fidelity Bank, fsb       May 26, 2017   January 29, 2019
 4    First-Citizens Bank & Trust Company        May 5, 2017     March 22, 2018
 ..                                   ...                ...                ...
 551                Superior Federal, FSB      July 27, 2001    August 19, 2014
 552                    North Valley Bank        May 3, 2001  November 18, 2002
 553  Southern New Hampshire Bank & Trust   February 2, 2001  February 18, 2003
 554              Banterra Bank of Marion  December 14, 2000     March 17, 2005
 555                   Bank of the Orient   October 13, 2000     March 17, 2005

 [556 rows x 7 columns]]

In [11]:
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","August 12, 2019"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
...,...,...,...,...,...,...,...
551,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
552,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
553,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
554,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
555,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [12]:
from sqlalchemy import create_engine

In [13]:
engine = create_engine('sqlite:///:memory:')

建立一個短暫存在在記憶體中的 SQL。

In [14]:
df.to_sql('my_table',engine)

將原本的 df 寫入在這個 engine 的 SQL中，並將資料表名稱設定為 my_table。

In [15]:
sqldf = pd.read_sql('my_table',con = engine)

In [16]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15